Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/arrests/powers_of_search.html.txt.tmx
Source language: en
Languages: ga

source: When the Gardai are conducting their investigation of a crime, they may need to search certain premises to look for evidence
ga: Nuair a bhíonn na Gardaí ag tabhairt faoina n-imscrúdú ar choir, b’fhéidir go dteastóidh uathu áitreabh a chuardach chun fianaise a chuardach

source: Generally, the Gardai must obtain a search warrant before they may search your premises or home without your consent
ga: Go ginearálta, ní mór do na Gardaí barántas cuardaigh a fháil sular féidir leo d’áitreabh nó do theach a chuardach gan do thoiliú

source: A garda can ask you to stop at any time
ga: Féadfaidh Garda iarraidh ort stopadh ag aon tráth

source: In certain circumstances, such as when you are driving, you must stop if asked to by a Garda
ga: I gcúinsí áirithe, ar nós nuair atá tú ag tiomáint, ní mór duit stopadh má iarrann Garda ort

source: A garda can search you, without your consent, if the garda has reasonable suspicion that you have committed an offence
ga: Féadfaidh Garda thú a chuardach, fiú mura dtugann tú toiliú, má tá amhras réasúnta ar an nGarda go ndearna tú cion

source: This includes people under the age of 18
ga: Áirítear leis seo daoine faoi aois 18 mbliana

source: The Garda should tell you why you are being searched
ga: Ba cheart don Gharda insint duit cén fáth a bhfuil tú á chuardach

source: A search warrant is a written order giving a person authority to enter a premises and search for and seize property
ga: Ordú scríofa is ea barántas cuardaigh a thugann údarás do dhuine chun áitreabh a iontráil agus cuardach a dhéanamh ar réadmhaoin agus réadmhaoin a urghabháil

source: They may be issued to Gardaí or to other authorised people for example, health inspectors, health and safety inspectors, social welfare officers, TV licence inspectors
ga: Féadtar iad a eisiúint do Ghardaí nó do dhaoine eile a bhfuil an t-údarás acu, mar shampla, cigirí sláinte, cigirí sláinte agus sábháilteachta, oifigigh leasa shóisialaigh, cigirí ceadúnas teilifíse

source: The circumstances in which search warrants may be issued vary from one piece of legislation to another
ga: Is éagsúil a bhíonn na cúinsí inar féidir barántais chuardaigh a eisiúint ó phíosa reachtaíochta amháin go píosa eile

source: Generally, search warrants are issued by District Court Judges or Peace Commissioners when a Garda makes a statement on oath that he/she knows or has reasonable cause for believing or suspecting that a crime has been or is being committed
ga: Go ginearálta, eisíonn Breithiúna na Cúirte Dúiche nó Feidhmeannaigh Shíochána barántais chuardaigh nuair a dhéanann Garda ráiteas faoi mhionn gurb eol dó/di nó go bhfuil údar réasúnta aige/aici a chreidiúint nó a bheith in amhras go ndearnadh cion nó go bhfuil cion á dhéanamh

source: In general, reasonable force may be used to execute a search warrant
ga: Go ginearálta, féadtar fórsa réasúnta a úsáid chun barántas cuardaigh a fhorghníomhú

source: Items of evidence obtained as a result of a legal and valid search may be kept and used as evidence in any criminal proceedings against you
ga: Féadtar earraí fianaise a fuarthas mar thoradh ar chuardach dlíthiúil agus bailí a choimeád agus a úsáid mar fhianaise in aon imeachtaí coiriúla i do leith

source: Search warrants must be executed within the time limits set out in them
ga: Ní mór barántais chuardaigh a fhorghníomhú laistigh de na teorainneacha ama a leagtar amach iontu

source: If they are not executed within the time limits, then any information obtained as a result of the search may not be admitted in evidence in a trial
ga: Mura bhforghníomhaítear iad laistigh de na teorainneacha ama, ní fhéadtar aon fhaisnéis a fhaightear mar thoradh ar an gcuardach a cheadú mar fhianaise i dtriail

source: When you are arrested, the Gardai may take goods in your possession if they believe that it is necessary to do so and if the goods are evidence in support of a criminal charge
ga: Nuair a ghabhtar thú, féadfaidh na Gardaí earraí atá faoi do sheilbh a ghlacadh uait má chreideann siad gur riachtanach amhlaidh a dhéanamh agus más fianaise iad na hearraí a thacaíonn le cúiseamh coiriúil

source: The Gardai may search you after your arrest without a search warrant and the goods seized may be kept and used as evidence at your trial
ga: Féadfaidh na Gardaí thú a chuardach i ndiaidh go ngabhtar thú gan barántas cuardaigh agus féadtar na hearraí a urghabhtar a choimeád agus a úsáid mar fhianaise ag do thriail

source: Necessity for a Search Warrant
ga: An Gá atá le Barántas Cuardaigh

source: In most cases, a search warrant is necessary before a Garda may search a person, a vehicle or a premises
ga: I dtromlach na gcásanna, teastaíonn barántas cuardaigh sular féidir le Garda duine, feithicil nó áitreabh a chuardach

source: However, certain legislation entitles the Gardai to go on premises without a warrant, for example, the Intoxicating Liquor Acts, the Public Dance Halls Act, and the Health Acts
ga: Tugann reachtaíocht áirithe, áfach, an teidlíocht do na Gardaí áitreabh a iontráil gan bharántas, mar shampla, na hAchtanna Deochanna Meisciúla, an tAcht um Hallaí Rince Poiblí, agus na hAchtanna Sláinte

source: If a Garda gets a search warrant relating to certain offences he/she may search the premises named and any person on the premises
ga: Má fhaigheann Garda barántas cuardaigh a bhaineann le cionta áirithe, féadfaidh é/í an t-áitreabh atá ainmnithe agus aon duine san áitreabh a chuardach

source: Examples of this are a search warrant issued under the Offences Against the State Act 1939, or the Criminal Justice (Theft and Fraud) Offences Act 2001
ga: Samplaí de seo é barántas cuardaigh a eisítear faoin Acht um Chiontaí in Aghaidh an Stáit, 1939, nó an tAcht um Cheartas Coiriúil, (Cionta Gadaíochta agus Calaoise), 2001

source: Under the Criminal Justice (Miscellaneous Provisions) Act 1979, as amended by Section 6 of the Criminal Justice Act 2006, the Gardaí can obtain a warrant in relation to an arrestable offence
ga: Faoin Acht um Cheartas Coiriúil (Forálacha Ilghnéitheacha), 1979, arna leasú ag Alt 6 den Acht um Cheartas Coiriúil, 2006, féadfaidh na Gardaí barántas a fháil maidir le cion inghabhála

source: Other legislation, for example, the Dublin Police Act, the Misuse of Drugs Act, the Criminal Law Act and the Animal Remedies Act, entitles police officers to search you and/or your vehicle without a warrant
ga: Tugann reachtaíocht eile, mar shampla, Acht Póilíneachta Bhaile Átha Cliath, an tAcht um Mí-Úsáid Drugaí, an tAcht um an Dlí Coiriúil agus an tAcht um Leigheasanna Ainmhithe, an teidlíocht do Ghardaí thú agus/nó d’fheithicil a chuardach gan bharántas

source: If one of these statutes is being invoked in order to search you without a search warrant, you are entitled to told about it
ga: Má tá ceann de na reachtanna seo á ghairm chun thú a chuardach gan bharántas, tá tú i dteideal go gcuirtear ar an eolas thú faoi

source: Evidence obtained on foot of an invalid search warrant or obtained without a warrant may be excluded by the trial judge and must be excluded if the search involved a deliberate and conscious breach of your constitutional rights
ga: Féadfaidh breitheamh na trialach fianaise a fuarthas de bhun barántas neamhbhailí cuardaigh nó a fuarthas gan bharántas a fhágáil ar lár agus ní mór an fhianaise sin a fhágáil ar lár má rinneadh sárú d’aon turas agus comhfhiosach ar do chearta bunreachtúla

source: In extraordinary excusing circumstances, the court may allow evidence obtained as a result of a deliberate and conscious breach of the Constitution
ga: Faoi imthosca urghnácha maolaitheacha, féadfaidh an chúirt fianaise a cheadú a fuarthas mar thoradh ar shárú d’aon turas agus comhfhiosach ar an mBunreacht

source: However, these circumstances are very rare, for example, a case involving an urgent need to rescue a victim in danger
ga: Is rí-annamh do na himthosca seo, áfach, mar shampla, cás ina bhfuil gátar práinneach ann chun íospartach atá i mbaol a thabhairt slán

source: More Information on Garda search powers is available in the Irish Council for Civil Liberties (ICCL) Know Your Rights publication Criminal Justice and Garda Powers
ga: Tá fáil ar bhreis faisnéise ar chumhachtaí cuardaigh an Gharda Síochána san fhoilseachán Bíodh Eolas agat ar do Chearta Cumhachtaí Ceartais Choiriúil agus Gardaí de chuid Chomhairle um Chearta an Duine
